"""
Найдите значения выражений
1. (0 или 1) и (0 или 1)
2. 0 или 1 и 0 или 1
3. (a или 1) или (b и 0)
"""

f1 = (0 or 1) and (0 or 1)
print('f1 = ', f1)

f2 = 0 or 1 and 0 or 1  #0 or 0 or 1
print('f2 = ', f2)

a = 1
b = 0

f3 = (a or 1) or (b and 0)
print('f3 = ', f3)
