"""
Дан список из 20 произвольных целых чисел.
Найти сумму элементов этого списка.

-------------------
Тестовые значения:
[1,2,3,4,5,6,7,8,9,0,1,2,3,4,5,6,7,8,9,0]  сумма: 90
[1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1]  сумма: 20
[10,20,30,40,50,60,70,80,90,100,0,1,2,3,4,5,6,7,8,9] сумма: 595
"""

l = [1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 0]
sum_l = sum(l)
print('Summa l: ', sum_l)

l1 = [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
sum_l1 = sum(l1)
print('Summa l1: ', sum_l1)

l2 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
sum_l2 = sum(l2)
print('Summa l2: ', sum_l2)
